package weiban

import (
	"bytes"
	"crypto/aes"
	"encoding/base64"
	"fmt"
	"io"
	"io/ioutil"
	"log"
	"math/rand"
	"net/http"
	"os"
	"strings"
	"time"

	"github.com/yatori-dev/yatori-go-core/utils"
)

type WeiBanCache struct {
	School     string //学校
	TenantCode string //学校id
	VerifyTime string //验证码时间戳
	VerifyCode string //验证码
	Account    string //账号
	Password   string //密码
	Cookies    []*http.Cookie
}

// 拉取学校列表
// {"code":"0","data":[{"index":"a","list":[{"code":"23300001","name":"安徽财经大学"},{"code":"23300009","name":"安徽师范大学"},{"code":"0000010","name":"安全教育"},{"code":"4134012925","name":"安徽医学高等专科学校"},{"code":"szzs2025","name":"安全素质证书"},{"code":"4134012334","name":"安徽工业经济职业技术学院"},{"code":"aq001","name":"安全知识竞赛"},{"code":"24600001","name":"安庆师范大学"},{"code":"210916001X","name":"安全感问卷"},{"code":"aqsxg20190319","name":"安全实训馆"},{"code":"00009","name":"安全教育专业委员会"},{"code":"23900001","name":"安徽滁州技师学院（滁州市机电工程学校）"},{"code":"4134012816","name":"安徽交通职业技术学院"},{"code":"230000114","name":"安徽艺术学院"},{"code":"24100006","name":"安徽国防科技职业学院"},{"code":"24100005","name":"安徽职业技术学院"},{"code":"24100004","name":"安徽中医药高等专科学校"},{"code":"24100002","name":"安徽机电职业技术学院"},{"code":"24100001","name":"安徽商贸职业技术学院"},{"code":"4141010479","name":"安阳师范学院"},{"code":"3200631","name":"安康学院"},{"code":"24300002","name":"安徽工业大学"},{"code":"aqg001","name":"安全感指数"},{"code":"23000018","name":"安徽新华学院"},{"code":"23000014","name":"安徽大学艺术与传媒学院"},{"code":"23000010","name":"安徽工商职业学院"},{"code":"23000011","name":"安徽医科大学"},{"code":"23000012","name":"安徽国际商务职业学院"},{"code":"23000013","name":"安徽工程大学"},{"code":"23000007","name":"安徽广播影视职业技术学院"},{"code":"23000004","name":"安徽大学"},{"code":"23000005","name":"安徽建筑大学"},{"code":"23000006","name":"安徽水利水电职业技术学院"},{"code":"23000001","name":"安徽农业大学"},{"code":"111111","name":"安全教育前置测试"},{"code":"2021051001","name":"安全感2"},{"code":"4134010361","name":"安徽理工大学"},{"code":"4134010360","name":"安徽工业大学建筑工程学院"},{"code":"4134010369","name":"安徽中医药大学"},{"code":"41340103601","name":"安徽工业大学冶金工程学院"},{"code":"230011001","name":"安徽粮食工程职业学院"}]},{"index":"b","list":[{"code":"4134013343","name":"亳州职业技术学院"},{"code":"10220003","name":"北京市实验技工学校"},{"code":"10220001","name":"北京农学院"},{"code":"10220002","name":"北京劳动保障职业学院"},{"code":"01400001","name":"包头医学院"},{"code":"23300002","name":"蚌埠学院"},{"code":"4137012818","name":"滨州职业学院"},{"code":"4111011417","name":"北京联合大学"},{"code":"fvet001","name":"北京市妇女儿童社会服务中心"},{"code":"12200001","name":"北京工业大学"},{"code":"10004402","name":"北京交通大学-本科生"},{"code":"51900003","name":"北京师范大学珠海校区"},{"code":"10000024","name":"北京信息科技大学"},{"code":"10000027","name":"北京建筑大学"},{"code":"10000029","name":"北京理工大学"},{"code":"10000014","name":"北京印刷学院"},{"code":"10000015","name":"北京开放大学"},{"code":"10000016","name":"北京体育大学"},{"code":"10000017","name":"北京师范大学"},{"code":"10000002","name":"北京青年政治学院"},{"code":"10000004","name":"北京麦课教育"},{"code":"10000007","name":"北方工业大学"},{"code":"10000008","name":"北京服装学院"},{"code":"10000010","name":"北京林业大学"},{"code":"12561","name":"北京财贸职业学院"},{"code":"1000001101X","name":"北京外国语大学"},{"code":"4111010001yx","name":"北京大学医学部"},{"code":"10000002ds","name":"北京青年政治学院（党史学习）"},{"code":"25660001","name":"滨州医学院"},{"code":"10260001","name":"北京市新媒体技师学院"},{"code":"102206xx06","name":"北京市昌平区十三陵中心小学"},{"code":"51908801","name":"北京理工大学珠海学院"},{"code":"102206xx01","name":"北京市昌平区史各庄中心小学"},{"code":"4111010032","name":"北京语言大学"},{"code":"4113010096","name":"保定学院"},{"code":"10008901","name":"北京航空航天大学"},{"code":"362088801","name":"北师香港浸会大学"},{"code":"1000440201","name":"北京交通大学-研究生"},{"code":"10011","name":"北京工商大学"},{"code":"10013","name":"北京邮电大学"},{"code":"4111010853","name":"北京工业职业技术学院"},{"code":"10023","name":"北京协和医学院"},{"code":"06500002","name":"北华航天工业学院"},{"code":"551700","name":"毕节工业职业技术学院"},{"code":"72101301","name":"宝鸡文理学院"},{"code":"2021032201","name":"北工大辅导员"},{"code":"4115014187","name":"包头铁道职业技术学院"},{"code":"bjwf001","name":"北京王府学校"},{"code":"71210001","name":"备用"},{"code":"4111012451","name":"北京政法职业学院"}]},{"index":"c","list":[{"code":"4132011055","name":"常州工学院"},{"code":"4150010643","name":"重庆三峡学院"},{"code":"4143013806","name":"长沙师范学院"},{"code":"4150010637","name":"重庆师范大学"},{"code":"4150010618","name":"重庆交通大学"},{"code":"00000000","name":"测试大学"},{"code":"cg20201014","name":"常规上线测试大学"},{"code":"64600003","name":"成都工业学院"},{"code":"40000002","name":"重庆市公共交通技工学校"},{"code":"40000001","name":"重庆大学"},{"code":"4134014297","name":"滁州城市职业学院"},{"code":"4151014389","name":"成都师范学院"},{"code":"21300003","name":"常州工程职业技术学院"},{"code":"4132010292","name":"常州大学"},{"code":"43000008","name":"长江工程职业技术学院"},{"code":"4143012603","name":"长沙商贸旅游职业技术学院"},{"code":"14699","name":"赤峰应用技术职业学院"},{"code":"024000","name":"赤峰学院"},{"code":"23900002","name":"滁州职业技术学院"},{"code":"41500001","name":"常德职业技术学院"},{"code":"410076","name":"长沙理工大学"},{"code":"4132012807","name":"常州纺织服装职业技术学院"},{"code":"102206xx04","name":"昌平第三实验小学"},{"code":"102206xx03","name":"昌平第二实验小学"},{"code":"4113010093","name":"承德医学院"},{"code":"4150011799","name":"重庆工商大学"},{"code":"4151011553","name":"成都纺织高等专科学校"},{"code":"40224701","name":"重庆公共运输职业学院"},{"code":"71000009","name":"长安大学"},{"code":"24710001","name":"池州学院"},{"code":"4132013114","name":"常州机电职业技术学院"},{"code":"4151010621","name":"成都信息工程大学"},{"code":"4132013101","name":"常州工业职业技术学院"},{"code":"4134010380","name":"巢湖学院"},{"code":"4134010377","name":"滁州学院"},{"code":"40415501","name":"重庆三峡职业学院"},{"code":"61000006","name":"成都农业科技职业学院"},{"code":"61000007","name":"成都理工大学"},{"code":"4143014692","name":"长沙幼儿师范高等专科学校"},{"code":"4134013060","name":"池州职业技术学院"},{"code":"4151011079","name":"成都大学"}]},{"index":"d","list":[{"code":"dongcai","name":"东北财经大学"},{"code":"20220331","name":"抖快测试"},{"code":"33000019","name":"东华理工大学"},{"code":"52380801","name":"东莞职业技术学院"},{"code":"234","name":"滴滴"},{"code":"678499","name":"德宏师范学院"},{"code":"05000004","name":"东北大学秦皇岛分校"},{"code":"4131010255","name":"东华大学"},{"code":"25300001","name":"德州学院"},{"code":"4132010286","name":"东南大学"},{"code":"51000010","name":"东莞理工学院"},{"code":"00008","name":"东北财经大学培训与继续教育学院"},{"code":"4111010036","name":"对外经济贸易大学"},{"code":"61050002","name":"电子科技大学"},{"code":"4121010141","name":"大连理工大学"},{"code":"4121010145","name":"东北大学"}]},{"index":"e","list":[{"code":"4115014532","name":"鄂尔多斯应用技术学院"},{"code":"4115014248","name":"鄂尔多斯职业学院"}]},{"index":"f","list":[{"code":"13763","name":"福建江夏学院"},{"code":"36200003","name":"福建电力职业技术学院"},{"code":"363000005","name":"福建师范大学"},{"code":"363000012","name":"福建林业职业技术学院"},{"code":"fsqcjzx","name":"房山区成教中心"},{"code":"13470","name":"福州大学至诚学院"},{"code":"13472","name":"福建师范大学协和学院"},{"code":"4135014683","name":"福建技术师范学院"},{"code":"36600001","name":"福建水利电力职业技术学院"},{"code":"35000006","name":"福建信息职业技术学院"},{"code":"35000009","name":"福建艺术职业学院"},{"code":"35000008","name":"福建医科大学"},{"code":"35000001","name":"福建农林大学"},{"code":"35000003","name":"福州大学"},{"code":"35000005","name":"福建中医药大学"},{"code":"35000010","name":"福建理工大学"},{"code":"35000011","name":"福建农林大学金山学院"},{"code":"4135012633","name":"福建卫生职业技术学院"}]},{"index":"g","list":[{"code":"1","name":"国防工业出版社"},{"code":"4144012322","name":"广东农工商职业技术学院"},{"code":"4152014734","name":"贵州财经职业学院"},{"code":"33000027","name":"赣东学院"},{"code":"4144011845","name":"广东工业大学"},{"code":"4144012736","name":"广东职业技术学院"},{"code":"34100001","name":"赣州师范高等专科学校"},{"code":"34100002","name":"赣南医科大学"},{"code":"4145014722","name":"广西制造工程职业技术学院"},{"code":"4152014616","name":"贵州经贸职业技术学院"},{"code":"4145014764","name":"广西农业工程职业技术学院"},{"code":"4145014313","name":"广西卫生职业技术学院"},{"code":"4132012078","name":"硅湖职业技术学院"},{"code":"4162010735","name":"甘肃中医药大学"},{"code":"4145014026","name":"广西英华国际职业学院"},{"code":"4144010862","name":"广东水利电力职业技术学院"},{"code":"4144010861","name":"广东交通职业技术学院"},{"code":"4152011731","name":"贵州商学院"},{"code":"4145011837","name":"桂林旅游学院"},{"code":"55002502","name":"贵州轻工职业大学"},{"code":"55002504","name":"贵州医科大学"},{"code":"55002503","name":"贵州职业技术学院"},{"code":"51000003","name":"广州中医药大学"},{"code":"51000012","name":"广州民航职业技术学院"},{"code":"51000011","name":"广州康大职业技术学院"},{"code":"51000007","name":"广东外语外贸大学"},{"code":"51000004","name":"广州南洋理工职业学院"},{"code":"51000009","name":"广州体育职业技术学院"},{"code":"4144013930","name":"广东工程职业技术学院"},{"code":"41440137151","name":"广州涉外经济职业技术学院"},{"code":"4145011773","name":"广西职业技术学院"},{"code":"4145014821","name":"广西质量工程职业技术学院"},{"code":"4145013520","name":"广西警察学院"},{"code":"52900001","name":"广东南方职业学院"},{"code":"4152014769","name":"贵州文化旅游职业学院"},{"code":"55000802","name":"贵州工业职业技术学院"},{"code":"4144014760","name":"广东云浮中医药职业学院"},{"code":"4144014761","name":"广东肇庆航空职业学院"},{"code":"4144012577","name":"广东行政职业学院"},{"code":"4144012578","name":"广东体育职业技术学院"},{"code":"4144012572","name":"广东科学技术职业学院"},{"code":"55000002","name":"贵州理工学院"},{"code":"4145010607","name":"广西艺术学院"},{"code":"4145010604","name":"广西民族师范学院"},{"code":"4145010600","name":"广西中医药大学"},{"code":"51150001","name":"广东碧桂园职业学院"},{"code":"4144012959","name":"广东工贸职业技术学院"},{"code":"4144012953","name":"广东邮电职业技术学院"},{"code":"4144012961","name":"广东亚视演艺职业学院"},{"code":"4144012962","name":"广东省外语艺术职业学院"},{"code":"53000001","name":"广西大学"},{"code":"53000004","name":"广西农业职业技术大学"},{"code":"53000002","name":"广西民族大学"},{"code":"4152014469","name":"贵阳幼儿师范高等专科学校"},{"code":"4145010596","name":"桂林理工大学南宁分校"},{"code":"4145010595","name":"桂林电子科技大学"},{"code":"4144010833","name":"广东轻工职业技术大学"},{"code":"4152012223","name":"贵州航天职业技术学院"},{"code":"4152012222","name":"贵州交通职业大学"},{"code":"4152014412","name":"贵州工商职业学院"},{"code":"551416","name":"贵州水利水电职业技术学院"},{"code":"4145012364","name":"广西工业职业技术学院"},{"code":"550025000","name":"贵州财经大学"},{"code":"73000005","name":"甘肃农业大学"},{"code":"4152010663","name":"贵州师范大学"},{"code":"4152010662","name":"贵州中医药大学"},{"code":"4152012850","name":"贵州城市职业学院"},{"code":"4152010672","name":"贵州民族大学"},{"code":"4144014610","name":"广东江门中医药职业学院"},{"code":"4152014613","name":"贵州装备制造职业学院"},{"code":"510320","name":"广东财经大学"},{"code":"73007003","name":"甘肃政法大学"},{"code":"4152014580","name":"贵州电子科技职业学院"},{"code":"4144014664","name":"广东江门幼儿师范高等专科学校"},{"code":"4152014516","name":"贵州建设职业技术学院"},{"code":"4152013650","name":"贵阳信息科技学院"},{"code":"4152013651","name":"贵州民族大学人文科技学院"},{"code":"4144012046","name":"广州职业技术大学"},{"code":"4145014668","name":"广西自然资源职业技术学院"},{"code":"4145014684","name":"广西职业师范学院"},{"code":"4144012060","name":"广东松山职业技术学院"},{"code":"550005","name":"贵阳学院"},{"code":"4162013519","name":"甘肃交通职业技术学院"}]},{"index":"h","list":[{"code":"053000","name":"衡水学院"},{"code":"4144012772","name":"河源职业技术学院"},{"code":"4144014510","name":"惠州城市职业学院"},{"code":"4146014172","name":"海南科技职业大学"},{"code":"417000","name":"湖南人文科技学院"},{"code":"4142010487","name":"华中科技大学"},{"code":"10213","name":"哈尔滨工业大学（威海）"},{"code":"4113013393","name":"河北机电职业技术学院"},{"code":"05000002","name":"河北大学"},{"code":"05000006","name":"河北经贸大学"},{"code":"4113013414","name":"河北经贸大学经济管理学院"},{"code":"43007012","name":"华中农业大学"},{"code":"4131010251","name":"华东理工大学"},{"code":"4123013307","name":"哈尔滨华德学院"},{"code":"4123010213","name":"哈尔滨工业大学（深圳）"},{"code":"4143010830","name":"湖南工业职业技术学院"},{"code":"4132010294","name":"河海大学"},{"code":"43000006","name":"湖北大学"},{"code":"43007913","name":"华中师范大学"},{"code":"43007912","name":"湖北工业大学"},{"code":"23071712872","name":"杭州职业技术学院"},{"code":"4143013941","name":"湖南高速铁路职业技术学院"},{"code":"22111601","name":"湖南财政经济学院"},{"code":"4142010929","name":"湖北医药学院"},{"code":"4142010518","name":"汉江师范学院"},{"code":"57190001","name":"海南健康管理职业技术学院"},{"code":"4115011709","name":"呼和浩特民族学院"},{"code":"361021001","name":"华侨大学"},{"code":"4142014099","name":"湖北第二师范学院"},{"code":"4143014468","name":"湖南幼儿师范高等专科学校"},{"code":"15000001","name":"黑龙江中医药大学"},{"code":"4142014467","name":"湖北幼儿师范高等专科学校"},{"code":"102206xx05","name":"回龙观第二小学"},{"code":"102206xx02","name":"华北电力附属小学"},{"code":"4134014191","name":"徽商职业学院"},{"code":"43800012","name":"黄冈师范学院"},{"code":"410205","name":"湖南第一师范学院"},{"code":"4113010089","name":"河北医科大学"},{"code":"4113010077","name":"河北地质大学"},{"code":"4113010086","name":"河北农业大学"},{"code":"4113010081","name":"华北理工大学"},{"code":"4113010080","name":"河北工业大学"},{"code":"4141010476","name":"河南师范大学"},{"code":"4141010471","name":"河南中医药大学"},{"code":"4141011329","name":"河南工学院"},{"code":"430205","name":"湖北城市建设职业技术学院"},{"code":"01500001","name":"河套学院"},{"code":"4143010541","name":"湖南中医药大学"},{"code":"4143010534","name":"湖南科技大学"},{"code":"4143010537","name":"湖南农业大学"},{"code":"06500001","name":"河北东方学院"},{"code":"223300001","name":"淮阴师范学院"},{"code":"4133012875","name":"湖州职业技术学院"},{"code":"06520101","name":"华北科技学院"},{"code":"72300201","name":"汉中职业技术学院"},{"code":"4141014307","name":"河南应用技术职业学院"},{"code":"15000101","name":"哈尔滨工业大学"},{"code":"102200xx01","name":"回龙观中心小学"},{"code":"4142013249","name":"湖北医药学院药护学院"},{"code":"4142013250","name":"湖北恩施学院"},{"code":"4142013238","name":"湖北工业大学工程技术学院"},{"code":"410132","name":"湖南交通职业技术学院"},{"code":"41000401","name":"湖南开放大学"},{"code":"41000402","name":"湖南女子学院"},{"code":"41000403","name":"湖南广播电视大学"},{"code":"4134014058","name":"合肥财经职业学院"},{"code":"4113011420","name":"河北金融学院"},{"code":"4141014382","name":"河南推拿职业学院"},{"code":"23000003","name":"合肥工业大学"},{"code":"23000002","name":"合肥大学"},{"code":"24500001","name":"黄山学院"},{"code":"4134014330","name":"合肥幼儿师范高等专科学校"},{"code":"4142012979","name":"湖北三峡职业技术学院"},{"code":"57010001","name":"海南医科大学"},{"code":"4143012845","name":"湖南邮电职业技术学院"},{"code":"4500441","name":"河南体育学院"},{"code":"10078","name":"华北水利水电大学"},{"code":"10085","name":"河北水利电力学院"},{"code":"4142011600","name":"湖北经济学院"},{"code":"4113011920","name":"河北农业大学海洋学院"},{"code":"41008202","name":"湖南大学"},{"code":"31000002","name":"杭州医学院"},{"code":"16204","name":"河北工业职业技术大学"}]},{"index":"j","list":[{"code":"33000010","name":"江西财经大学"},{"code":"33000008","name":"江西制造职业技术学院"},{"code":"33000004","name":"江西警察学院"},{"code":"33000006","name":"江西艺术职业学院"},{"code":"33000001","name":"江西农业大学"},{"code":"4136013427","name":"江西建设职业技术学院"},{"code":"33000020","name":"江西工业贸易职业技术学院"},{"code":"33000018","name":"江西师范大学"},{"code":"33000017","name":"江西工程职业学院"},{"code":"33000011","name":"江西工业职业技术学院"},{"code":"33000030","name":"江西泛美艺术中等专业学校"},{"code":"33000032","name":"江西服装学院"},{"code":"33000031","name":"江西传媒职业学院"},{"code":"33000026","name":"江西中医药大学"},{"code":"33000029","name":"江西水利职业学院"},{"code":"33000028","name":"江西外语外贸职业学院"},{"code":"33000023","name":"九江职业技术学院"},{"code":"33000022","name":"江西交通职业技术学院"},{"code":"33000025","name":"江西理工大学南昌校区"},{"code":"33000024","name":"江西现代职业技术学院"},{"code":"4136012934","name":"江西环境工程职业学院"},{"code":"31400002","name":"嘉兴大学"},{"code":"32101701","name":"金华职业技术大学"},{"code":"4132014541","name":"江苏护理职业学院"},{"code":"4132011463","name":"江苏理工学院"},{"code":"4132012703","name":"江苏航运职业技术学院"},{"code":"4137013323","name":"济南职业学院"},{"code":"21000011","name":"江苏第二师范学院"},{"code":"4136014241","name":"江西冶金职业技术学院"},{"code":"4132010295","name":"江南大学"},{"code":"51000005","name":"暨南大学"},{"code":"4136014166","name":"江西新能源科技职业学院"},{"code":"434000","name":"荆州理工职业学院"},{"code":"22400501","name":"江苏医药职业学院"},{"code":"11223344556","name":"江汉大学"},{"code":"4132011641","name":"江苏海洋大学"},{"code":"0008","name":"江苏工程职业技术学院"},{"code":"21200002","name":"江苏科技大学"},{"code":"21200001","name":"江苏大学"},{"code":"4144013711","name":"江门职业技术学院"},{"code":"21200004","name":"江苏大学京江学院"},{"code":"21200005","name":"九州职业技术学院"},{"code":"338000","name":"江西省中山电子计算机中等专业学校"},{"code":"4132014475","name":"江苏商贸职业学院"},{"code":"41330120611","name":"金华职业技术大学技能培训"},{"code":"4132012679","name":"江苏海事职业技术学院"},{"code":"4132010849","name":"江苏建筑职业技术学院"}]},{"index":"k","list":[{"code":"55601105","name":"凯里学院"},{"code":"4165010763","name":"喀什大学"},{"code":"65000009","name":"昆明理工大学"},{"code":"65000002","name":"昆明医科大学"},{"code":"65000003","name":"昆明理工大学津桥学院"}]},{"index":"l","list":[{"code":"lqyq1231","name":"龙泉驿区新青年志愿者协会社工"},{"code":"36200005","name":"黎明职业大学"},{"code":"11050","name":"连云港职业技术学院"},{"code":"4137012441","name":"聊城职业技术学院"},{"code":"4145012104","name":"柳州职业技术学院"},{"code":"4113014335","name":"廊坊卫生职业学院"},{"code":"10732","name":"兰州交通大学"},{"code":"4145014067","name":"柳州城市职业学院"},{"code":"73005001","name":"兰州工业学院"},{"code":"471023","name":"洛阳理工学院"},{"code":"4152013054","name":"六盘水职业技术学院"},{"code":"742500","name":"陇南师范高等专科学校"},{"code":"4141014480","name":"洛阳科技职业学院"},{"code":"61400002","name":"乐山职业技术学院"},{"code":"LXAQ1020","name":"留学安全"},{"code":"4141010482","name":"洛阳师范学院"},{"code":"26400002","name":"鲁东大学"},{"code":"4137010452","name":"临沂大学"},{"code":"4162014771","name":"兰州航空职业技术学院"},{"code":"4121012895","name":"辽宁金融职业学院"},{"code":"23700001","name":"六安职业技术学院"},{"code":"4113010100","name":"廊坊师范学院"},{"code":"4141014383","name":"洛阳职业技术学院"},{"code":"73000001","name":"兰州大学"},{"code":"4121010146","name":"辽宁科技大学"},{"code":"4121010154","name":"辽宁工业大学"},{"code":"4121010162","name":"辽宁中医药大学"},{"code":"lqyq123","name":"龙泉驿区新青年志愿者协会"},{"code":"73007002","name":"兰州城市学院"},{"code":"1127329529","name":"兰州理工大学"},{"code":"4151010649","name":"乐山师范学院"},{"code":"111111111","name":"廊坊疾病预防控制中心"},{"code":"4162013515","name":"兰州信息科技学院"}]},{"index":"m","list":[{"code":"35000102","name":"闽江学院"},{"code":"966043911","name":"麦课大学"},{"code":"24300001","name":"马鞍山职业技术学院"},{"code":"4135013772","name":"湄洲湾职业技术学院"},{"code":"4135013764","name":"闽北职业技术学院"},{"code":"2020120101","name":"麦课社区安全"},{"code":"56450701","name":"茅台学院"},{"code":"42232201","name":"麦田教育志愿者"},{"code":"35000018","name":"闽南师范大学"},{"code":"4151010639","name":"绵阳师范学院"}]},{"index":"n","list":[{"code":"33000002","name":"南昌航空大学"},{"code":"33000021","name":"南昌理工学院"},{"code":"15365041880","name":"南京财经大学"},{"code":"33000015","name":"南昌航空大学科技学院"},{"code":"33000012","name":"南昌师范学院"},{"code":"4132011460","name":"南京晓庄学院"},{"code":"0000001","name":"南昌培训班"},{"code":"4164010753","name":"宁夏师范大学"},{"code":"4164010752","name":"宁夏医科大学"},{"code":"4164010749","name":"宁夏大学"},{"code":"35500001","name":"宁德职业技术学院"},{"code":"210000081","name":"南京邮电大学"},{"code":"21000015","name":"南京工业大学"},{"code":"21000006","name":"南京师范大学"},{"code":"21000003","name":"南京理工大学"},{"code":"4115013824","name":"内蒙古交通职业技术学院"},{"code":"4115012675","name":"内蒙古化工职业学院"},{"code":"750021","name":"宁夏回族自治区农业学校"},{"code":"4132012048","name":"南京特殊教育师范学院"},{"code":"4233050559","name":"宁波幼儿师范高等专科学校"},{"code":"4115014463","name":"内蒙古民族幼儿师范高等专科学校"},{"code":"35200001","name":"宁德师范学院"},{"code":"ANQUANJIAOYU","name":"XXXX"},{"code":"411501012901","name":"内蒙古农业大学职业技术学院"},{"code":"10284","name":"南京大学"},{"code":"4164013325","name":"宁夏大学新华学院"},{"code":"0100003","name":"内蒙古财经大学"},{"code":"4115010127","name":"内蒙古科技大学"},{"code":"4115010129","name":"内蒙古农业大学"},{"code":"10403","name":"南昌大学"},{"code":"4115014531","name":"内蒙古艺术学院"},{"code":"4132011287","name":"南京审计大学"},{"code":"4143010555","name":"南华大学"},{"code":"4132010330","name":"南京体育学院"},{"code":"4132010331","name":"南京艺术学院"},{"code":"13429","name":"南昌大学科学技术学院"},{"code":"13430","name":"南昌大学共青学院"},{"code":"4132010304","name":"南通大学"},{"code":"51800002","name":"南方科技大学"},{"code":"4112013663","name":"南开大学滨海学院"},{"code":"31500001","name":"宁波城市职业技术学院"},{"code":"4132014493","name":"南通师范高等专科学校"},{"code":"41320139812","name":"南京中医药大学(泰州校区)"},{"code":"4132013106","name":"南京铁道职业技术学院"},{"code":"4132013989","name":"南京邮电大学通达学院"},{"code":"4132013993","name":"南通大学杏林学院"},{"code":"4164013087","name":"宁夏工商职业技术学院"},{"code":"4164013088","name":"宁夏财经职业技术学院"},{"code":"4164013086","name":"宁夏职业技术学院"},{"code":"01000002","name":"内蒙古师范大学"},{"code":"01000001","name":"内蒙古医科大学"},{"code":"4151010640","name":"内江师范学院"},{"code":"10070","name":"内蒙古机电职业技术学院"},{"code":"4132013981","name":"南京中医药大学翰林学院"},{"code":"30000049","name":"南开大学"},{"code":"010051","name":"内蒙古工业大学"},{"code":"01007001","name":"内蒙古建筑职业技术学院"}]},{"index":"p","list":[{"code":"33700001","name":"萍乡学院"},{"code":"35110001","name":"莆田学院"}]},{"index":"q","list":[{"code":"4152011663","name":"黔南民族医学高等专科学校"},{"code":"55600001","name":"黔东南民族职业技术学院"},{"code":"36200006","name":"泉州师范学院"},{"code":"12877","name":"衢州职业技术学院"},{"code":"65500001","name":"曲靖医学高等专科学校"},{"code":"10000005","name":"清华大学"},{"code":"55002505","name":"青海民族大学"},{"code":"55002501","name":"青海卫生职业技术学院"},{"code":"4137012324","name":"青岛职业技术学院"},{"code":"4113016631","name":"秦皇岛市卫生学校"},{"code":"8100001","name":"青海师范大学"},{"code":"558000","name":"黔南民族师范学院"},{"code":"4137010431","name":"齐鲁工业大学"},{"code":"4152014497","name":"黔南民族幼儿师范高等专科学校"},{"code":"4113012773","name":"秦皇岛职业技术学院"},{"code":"810000","name":"青海理工学院"},{"code":"4152012823","name":"黔南民族职业技术学院"}]},{"index":"r","list":[{"code":"27680001","name":"日照职业技术学院"}]},{"index":"s","list":[{"code":"4144010576","name":"韶关学院"},{"code":"411401289","name":"山西林业职业技术学院"},{"code":"slm20190213","name":"森霖木"},{"code":"123456789","name":"实验室安全"},{"code":"4151014091","name":"四川财经职业学院"},{"code":"sfaq1024","name":"时分安全"},{"code":"4151014086","name":"四川文化产业职业学院"},{"code":"710300","name":"陕西国防工业职业技术学院"},{"code":"11003201","name":"沈阳体育学院"},{"code":"4151012637","name":"四川化工职业技术学院"},{"code":"72300001","name":"陕西理工大学"},{"code":"4151012212","name":"四川警察学院"},{"code":"05000007","name":"石家庄学院"},{"code":"4137013318","name":"山东工业职业学院"},{"code":"4137013317","name":"山东经贸职业学院"},{"code":"4114012775","name":"山西建筑职业技术学院"},{"code":"4161014650","name":"神木职业技术学院"},{"code":"100001130","name":"首都医科大学校卫队保安员"},{"code":"100001131","name":"首都医科大学应急指挥中心"},{"code":"2022122301","name":"顺义红色记忆新时代体验基地"},{"code":"10718","name":"陕西师范大学"},{"code":"26100001","name":"山东第二医科大学"},{"code":"03000102","name":"山西医科大学"},{"code":"25000001wh","name":"山东大学（威海）"},{"code":"4131010273","name":"上海对外经贸大学"},{"code":"4161010716","name":"陕西中医药大学"},{"code":"83200301","name":"石河子大学"},{"code":"14207","name":"上海财经大学浙江学院"},{"code":"4134012812","name":"宿州职业技术学院"},{"code":"4161012831","name":"陕西职业技术学院"},{"code":"71000114","name":"陕西国际商贸学院"},{"code":"1234567789","name":"四川省高校学生国家安全知识竞赛"},{"code":"4111010038","name":"首都经济贸易大学"},{"code":"71200005","name":"陕西能源职业技术学院"},{"code":"25000001","name":"山东大学"},{"code":"4151012065","name":"四川电力职业技术学院"},{"code":"20000001","name":"上海市大学生平安志愿者"},{"code":"12345679999999","name":"四川司法警官职业学院"},{"code":"4137010832","name":"山东商业职业技术学院"},{"code":"26420001","name":"山东药品食品职业学院"},{"code":"61123101","name":"四川水利职业技术学院"},{"code":"10000113","name":"首都医科大学"},{"code":"4151013815","name":"四川信息职业技术学院"},{"code":"4144012954","name":"汕头职业技术学院"},{"code":"4144012957","name":"深圳信息职业技术大学"},{"code":"510000","name":"四川省国家安全知识竞赛练习平台"},{"code":"4137010430","name":"山东建筑大学"},{"code":"4137014809","name":"山东城市服务职业学院"},{"code":"4132010333","name":"苏州工学院"},{"code":"11003401","name":"沈阳师范大学"},{"code":"4251051351","name":"四川体育职业学院"},{"code":"4137014438","name":"山东管理学院"},{"code":"4142011075","name":"三峡大学"},{"code":"51800001","name":"深圳职业技术学院"},{"code":"4113010107","name":"石家庄铁道大学"},{"code":"4161013566","name":"陕西铁路工程职业技术学院"},{"code":"4121011035","name":"沈阳大学建筑工程学院"},{"code":"4161011396","name":"商洛学院"},{"code":"4121010153","name":"沈阳建筑大学"},{"code":"4121010163","name":"沈阳药科大学"},{"code":"4161013125","name":"陕西服装工程学院"},{"code":"2000001","name":"上海理工大学"},{"code":"4134010379","name":"宿州学院"},{"code":"4151010654","name":"四川音乐学院"},{"code":"4151010636","name":"四川师范大学"},{"code":"4151012763","name":"四川工程职业技术大学"},{"code":"4151012764","name":"四川建筑职业技术学院"},{"code":"4137011688","name":"山东工商学院"},{"code":"25010301","name":"山东青年政治学院"},{"code":"4161013948","name":"商洛职业技术学院"},{"code":"25200001","name":"山东工程技师学院"},{"code":"4113012424","name":"石家庄铁路职业技术学院"},{"code":"21500001","name":"苏州大学"},{"code":"25001401","name":"山东财经大学"},{"code":"4114013745","name":"山西电力职业技术学院"},{"code":"71002101","name":"陕西交通职业技术学院"},{"code":"71002102","name":"陕西警察学院"},{"code":"4144016409","name":"深圳北理莫斯科大学"}]},{"index":"t","list":[{"code":"tjlb20190228","name":"天津龙宾"},{"code":"2021042601","name":"天津市大学软件学院（党史学习）"},{"code":"4114010112","name":"太原理工大学"},{"code":"84339901","name":"塔里木大学"},{"code":"14696","name":"唐山海运职业学院"},{"code":"4112010058","name":"天津工业大学"},{"code":"4112010066","name":"天津职业技术师范大学"},{"code":"4112010063","name":"天津中医药大学"},{"code":"4112010062","name":"天津医科大学"},{"code":"4112010071","name":"天津体育学院"},{"code":"4112010058ds","name":"天津工业大学（党史学习）"},{"code":"4133013746","name":"台州科技职业学院"},{"code":"4112011032","name":"天津职业大学"},{"code":"4113012785","name":"唐山职业技术学院"},{"code":"030008","name":"太原工业学院"},{"code":"200092","name":"同济大学"},{"code":"4113014586","name":"唐山幼儿师范高等专科学校"},{"code":"1469602","name":"唐山海运职业学院（教职工）"},{"code":"4134010383","name":"铜陵学院"},{"code":"30000053","name":"天津海运职业学院"},{"code":"30000005","name":"天津财经大学"},{"code":"30000003","name":"天津大学"},{"code":"14038","name":"天津仁爱学院"}]},{"index":"w","list":[{"code":"4142010488","name":"武汉科技大学"},{"code":"4142010496","name":"武汉轻工大学"},{"code":"430072","name":"武汉大学"},{"code":"4142010490","name":"武汉工程大学"},{"code":"4142011796","name":"武汉城市职业学院"},{"code":"4161010723","name":"渭南师范学院"},{"code":"4133014088","name":"温州科技职业学院"},{"code":"32500001","name":"温州医科大学"},{"code":"4142013634","name":"武汉学院"},{"code":"4133013637","name":"温州商学院"},{"code":"43000010","name":"武汉理工大学"},{"code":"43007911","name":"武汉体育学院"},{"code":"43007910","name":"武汉民政职业学院"},{"code":"10315","name":"温州大学"},{"code":"4137014507","name":"威海海洋职业学院"},{"code":"241000001","name":"皖南医学院"},{"code":"4137011067","name":"潍坊学院"},{"code":"24100003","name":"芜湖职业技术学院"},{"code":"4115013699","name":"乌兰察布职业学院"},{"code":"430200","name":"武汉纺织大学"},{"code":"11798","name":"武汉东湖学院"},{"code":"4133016405","name":"温州肯恩大学"},{"code":"21400001","name":"无锡职业技术学院"},{"code":"4142012978","name":"武汉软件工程职业学院"},{"code":"4142012981","name":"武汉电力职业技术学院"},{"code":"cs20220414","name":"外部测试大学"},{"code":"241000","name":"芜湖职业技术学院职师院"},{"code":"4142011654","name":"武汉商学院"},{"code":"35430001","name":"武夷学院"}]},{"index":"x","list":[{"code":"71007701","name":"西安航空学院"},{"code":"71007703","name":"西安职业技术学院"},{"code":"63700001","name":"西华师范大学"},{"code":"jt560015","name":"厦门市湖里区江头幼儿园"},{"code":"jt560014","name":"厦门市乌石浦嘉裕幼儿园"},{"code":"jt560013","name":"厦门市蓓蕾幼儿园"},{"code":"jt560012","name":"厦门市祥店幼儿园"},{"code":"jt560011","name":"厦门市早慧幼儿园"},{"code":"jt560010","name":"厦门市国光学校"},{"code":"jt560019","name":"厦门市理想幼儿园"},{"code":"jt560018","name":"厦门市康桥裕发双语幼儿园"},{"code":"jt560017","name":"厦门市湖里区嘉景幼儿园"},{"code":"jt560016","name":"厦门市立人国际幼稚园"},{"code":"jt560026","name":"厦门市春苗幼儿园"},{"code":"jt560025","name":"厦门市湖里区鑫晨光幼儿园"},{"code":"jt560024","name":"厦门市江头第三小学"},{"code":"jt560023","name":"厦门市育星幼儿园"},{"code":"jt560022","name":"厦门市湖里区金彩幼儿园"},{"code":"jt560021","name":"厦门市吕岭幼儿园"},{"code":"jt560020","name":"厦门市小星星幼儿园"},{"code":"jt560029","name":"厦门市光华学校"},{"code":"jt560028","name":"厦门市星光小学"},{"code":"jt560027","name":"厦门市秀德幼儿园金国里分园"},{"code":"jt560031","name":"厦门市吕岭幼儿园金安里分园"},{"code":"jt560030","name":"厦门市湖里区康希幼儿园"},{"code":"4161010728","name":"西安音乐学院"},{"code":"64600002","name":"西南科技大学"},{"code":"71010003","name":"西安财经大学"},{"code":"710038241","name":"西安财经大学行知学院"},{"code":"4161013894","name":"西安明德理工学院"},{"code":"4144014851","name":"香港城市大学（东莞）"},{"code":"10742","name":"西北民族大学"},{"code":"4161010703","name":"西安建筑科技大学"},{"code":"4161010700","name":"西安理工大学"},{"code":"710065","name":"西安文理学院"},{"code":"7100017","name":"西北大学"},{"code":"4161012828","name":"西安航空职业技术学院"},{"code":"710048","name":"西安工程大学"},{"code":"71000115","name":"西安外国语大学"},{"code":"xzb001","name":"学支部测试"},{"code":"71000120","name":"西安石油大学"},{"code":"71000117","name":"西安工业大学"},{"code":"71000116","name":"西安培华学院"},{"code":"4161010698","name":"西安交通大学"},{"code":"71200003","name":"西北农林科技大学"},{"code":"71200002","name":"西藏民族大学"},{"code":"71003204","name":"西安电力高等专科学校"},{"code":"4161011080","name":"西安美术学院"},{"code":"4132014329","name":"徐州幼儿师范高等专科学校"},{"code":"4165010758","name":"新疆农业大学"},{"code":"4154010694","name":"西藏大学"},{"code":"2023001","name":"学支部（测试专用）"},{"code":"4132010313","name":"徐州医科大学"},{"code":"bjxsq","name":"西三旗街道社区"},{"code":"001","name":"习得书院"},{"code":"423043","name":"湘南学院"},{"code":"71004801","name":"西安理工大学国际工学院"},{"code":"361102","name":"厦门市翔安职业技术学校"},{"code":"71000002","name":"西安商贸旅游技师学院"},{"code":"71000005","name":"西安电子科技大学"},{"code":"71000004","name":"西安欧亚学院"},{"code":"71000012","name":"西北工业大学"},{"code":"05400001","name":"邢台学院"},{"code":"4161013677","name":"西安交通大学城市学院"},{"code":"4161013679","name":"西安建筑科技大学华清学院"},{"code":"73000002","name":"西北师范大学"},{"code":"4161013569","name":"西安交通工程学院"},{"code":"4152010666","name":"兴义民族师范学院"},{"code":"4151010632","name":"西南医科大学"},{"code":"4151010615","name":"西南石油大学"},{"code":"4135013973","name":"厦门城市职业学院"},{"code":"4151010656","name":"西南民族大学"},{"code":"4154014085","name":"西藏职业技术学院"},{"code":"4154014086","name":"西藏警官高等专科学校"},{"code":"4143012846","name":"湘潭医卫职业技术学院"},{"code":"4151010651","name":"西南财经大学"},{"code":"111","name":"新疆医科大学"},{"code":"36100101","name":"厦门海洋职业技术学院"},{"code":"36100102","name":"厦门大学"},{"code":"36100103","name":"翔"},{"code":"36100104","name":"厦门技师学院"},{"code":"36100105","name":"厦门华天涉外职业技术学院"},{"code":"36100106","name":"厦门南洋学院"},{"code":"20250728","name":"心理微伴"},{"code":"61000005","name":"西南交通大学"},{"code":"jt560004","name":"厦门市湖里区后埔民办小学"},{"code":"jt560003","name":"厦门市湖里第二实验小学"},{"code":"jt560002","name":"厦门市乌石浦小学"},{"code":"jt560001","name":"厦门市蔡塘学校"},{"code":"850000","name":"西藏藏医药大学"},{"code":"jt560009","name":"厦门市江头中心小学"},{"code":"71012303","name":"西京学院"},{"code":"jt560008","name":"厦门市江浦南里幼儿园"},{"code":"jt560007","name":"厦门市湖里区康桥红橡树幼儿园"},{"code":"jt560006","name":"厦门市金尚小学"},{"code":"jt560005","name":"厦门市吕岭小学"}]},{"index":"y","list":[{"code":"123456","name":"永清县疾病预防控制中心"},{"code":"65050001","name":"云南师范大学"},{"code":"650500","name":"云南艺术学院"},{"code":"71600001","name":"延安大学"},{"code":"65022301","name":"云南警官学院"},{"code":"8113","name":"杨凌职业技术学院"},{"code":"653100","name":"玉溪师范学院"},{"code":"4114010123","name":"运城学院"},{"code":"4153014619","name":"云南特殊教育职业学院"},{"code":"4161014737","name":"榆林能源科技职业学院"},{"code":"4151013049","name":"雅安职业技术学院"},{"code":"650031","name":"云南农业职业技术学院"},{"code":"831199","name":"延安职业技术学院"},{"code":"65030001","name":"云南交通运输职业学院"},{"code":"4137011066","name":"烟台大学"},{"code":"4161013683","name":"延安大学西安创新学院"},{"code":"youer00001","name":"阳光早教"},{"code":"4153014381","name":"云南旅游职业学院"},{"code":"y28hysq","name":"乙28号院社区"},{"code":"06500003","name":"燕京理工学院"},{"code":"14833","name":"宜昌科技职业学院"},{"code":"4151012966","name":"宜宾职业技术学院"},{"code":"ysaq0001","name":"幼师安全培训"},{"code":"650228","name":"云南体育运动职业技术学院"},{"code":"65000006","name":"云南民族大学"},{"code":"65000005","name":"云南林业职业技术学院"},{"code":"65000008","name":"云南大学"},{"code":"65000004","name":"云南财经大学"},{"code":"65000010","name":"云南国防工业职业技术学院"},{"code":"yyxx0423","name":"育鹰小学"},{"code":"65170101","name":"云南工商学院"},{"code":"4132013987","name":"扬州大学广陵学院"},{"code":"650200","name":"云南中医药大学"},{"code":"4133013003","name":"义乌工商职业技术学院 "},{"code":"123456789123123","name":"演示专用"},{"code":"22500001","name":"扬州大学"},{"code":"4153012349","name":"云南国土资源职业学院"},{"code":"4113010216","name":"燕山大学"}]},{"index":"z","list":[{"code":"4133010876","name":"浙江万里学院"},{"code":"zb123456","name":"淄博麦田公益助学中心"},{"code":"4144010592","name":"自主学习"},{"code":"4142010491","name":"中国地质大学"},{"code":"42700001","name":"张家界航空工业职业技术学院"},{"code":"3100000102","name":"中国计量大学现代科技学院"},{"code":"20210902001","name":"中社联社区工作委员会"},{"code":"10010201","name":"中国社会科学院大学"},{"code":"4111011413","name":"中国矿业大学（北京）"},{"code":"41520106611","name":"遵义医科大学珠海校区"},{"code":"21000004","name":"中国药科大学"},{"code":"12200002","name":"中国音乐学院"},{"code":"51900002","name":"珠海科技学院"},{"code":"mk220729","name":"专用课程测试"},{"code":"10000026","name":"中央民族大学"},{"code":"10000013","name":"中国人民大学"},{"code":"zgdg001","name":"中国电工"},{"code":"30030001","name":"中国民航大学"},{"code":"10000009","name":"中央财经大学"},{"code":"4133012789","name":"浙江工商职业技术学院"},{"code":"43000007","name":"中南财经政法大学"},{"code":"43000005","name":"中南民族大学"},{"code":"22100001","name":"中国矿业大学"},{"code":"1035300","name":"浙江工商大学"},{"code":"4133011057","name":"浙江科技大学"},{"code":"311231","name":"浙江建设职业技术学院"},{"code":"56300001","name":"遵义师范学院"},{"code":"4135014110","name":"漳州城市职业学院"},{"code":"4141014040","name":"郑州商学院"},{"code":"mkzxxjy","name":"中小学安全教育"},{"code":"4133013294","name":"浙江财经大学东方学院"},{"code":"4135014117","name":"漳州卫生职业学院"},{"code":"554860016","name":"准点投资"},{"code":"4111010033","name":"中国传媒大学"},{"code":"36300001","name":"漳州职业技术学院"},{"code":"3100013","name":"浙江商业职业技术学院"},{"code":"451191","name":"郑州升达经贸管理学院"},{"code":"3100012","name":"浙江师范大学"},{"code":"4133012871","name":"浙江工业职业技术学院"},{"code":"4133012866","name":"浙江经济职业技术学院"},{"code":"4115014539","name":"扎兰屯职业学院"},{"code":"4141010843","name":"郑州铁路职业技术学院"},{"code":"4141010485","name":"郑州航空工业管理学院"},{"code":"4137010423","name":"中国海洋大学"},{"code":"4137xx02","name":"章丘区公安分局双山第二派出所"},{"code":"4152014011","name":"遵义医药高等专科学校"},{"code":"31100001","name":"浙江中医药大学"},{"code":"31000121","name":"浙江师范大学行知学院"},{"code":"41000404","name":"中南林业科技大学"},{"code":"341119","name":"中国科学院赣江创新研究院"},{"code":"4144013713","name":"珠海城市职业技术学院"},{"code":"21200003","name":"镇江市高等专科学校"},{"code":"31005301","name":"浙江机电职业技术大学"},{"code":"27710001","name":"枣庄学院"},{"code":"1469601","name":"暂停"},{"code":"4134010358","name":"中国科学技术大学"},{"code":"4133013002","name":"浙江东方职业技术学院"},{"code":"1234567","name":"中北大学"},{"code":"4141014635","name":"郑州卫生健康职业学院"},{"code":"4133013022","name":"浙大宁波理工学院"},{"code":"31000001","name":"中国计量大学"},{"code":"31000011","name":"浙江音乐学院"},{"code":"31000012","name":"中国美术学院"},{"code":"31000003","name":"浙江旅游职业学院"},{"code":"31000005","name":"浙江财经大学"},{"code":"31000006","name":"浙江艺术职业学院"},{"code":"31000007","name":"浙江工业大学"},{"code":"31000008","name":"浙江交通职业技术学院"},{"code":"14492","name":"浙江安防职业技术学院"},{"code":"4141014235","name":"郑州城市职业学院"},{"code":"20211105","name":"中国灾害防御协会"}]}],"detailCode":"0"}
func (cache *WeiBanCache) PullTenantCodeApi() (string, error) {

	urlStr := "https://weiban.mycourse.cn/pharos/login/getTenantListWithLetter.do?timestamp=1758343815.004"
	method := "POST"

	client := &http.Client{}
	req, err := http.NewRequest(method, urlStr, nil)

	if err != nil {
		fmt.Println(err)
		return "", err
	}
	req.Header.Add("User-Agent", utils.DefaultUserAgent)
	req.Header.Add("Accept", "*/*")
	req.Header.Add("Host", "weiban.mycourse.cn")
	req.Header.Add("Connection", "keep-alive")

	res, err := client.Do(req)
	if err != nil {
		fmt.Println(err)
		return "", err
	}
	defer res.Body.Close()

	body, err := ioutil.ReadAll(res.Body)
	if err != nil {
		fmt.Println(err)
		return "", err
	}
	fmt.Println(string(body))
	return string(body), nil
}

// 拉取学校配置
func (cache *WeiBanCache) PullTenantConfigApi() (string, error) {

	url := "https://weiban.mycourse.cn/pharos/tenantconfig/getSimpleConfig.do?timestamp=1758343997.34"
	method := "POST"

	payload := strings.NewReader("tenantCode=" + cache.TenantCode)

	client := &http.Client{}
	req, err := http.NewRequest(method, url, payload)

	if err != nil {
		fmt.Println(err)
		return "", err
	}
	req.Header.Add("User-Agent", utils.DefaultUserAgent)
	req.Header.Add("Accept", "*/*")
	req.Header.Add("Host", "weiban.mycourse.cn")
	req.Header.Add("Connection", "keep-alive")
	req.Header.Add("Content-Type", "application/x-www-form-urlencoded")
	//req.Header.Add("Cookie", "SERVERID=960d3937b58d431003f75e175ffea128|1758344099|1758343911")

	res, err := client.Do(req)
	if err != nil {
		fmt.Println(err)
		return "", err
	}
	defer res.Body.Close()

	body, err := ioutil.ReadAll(res.Body)
	if err != nil {
		fmt.Println(err)
		return "", err
	}
	//fmt.Println(string(body))
	return string(body), nil
}

var randChar []string = []string{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "a", "b", "c", "d", "e", "f", "A", "B", "C", "D", "E", "F"}

// 拉取验证码
func (cache *WeiBanCache) PullCapterApi(retry int, lastErr error) (string, error) {
	if lastErr != nil {
		return "", lastErr
	}
	randomTime := fmt.Sprintf("%d", time.Now().UnixMilli())
	cache.VerifyTime = randomTime
	urlStr := "https://weiban.mycourse.cn/pharos/login/randLetterImage.do?time=" + randomTime
	method := "GET"

	client := &http.Client{}
	req, err := http.NewRequest(method, urlStr, nil)

	if err != nil {
		fmt.Println(err)
		return "", err
	}
	req.Header.Add("User-Agent", utils.DefaultUserAgent)
	req.Header.Add("Accept", "*/*")
	req.Header.Add("Host", "weiban.mycourse.cn")
	req.Header.Add("Connection", "keep-alive")
	//req.Header.Add("Cookie", "SERVERID=960d3937b58d431003f75e175ffea128|1758344218|1758343911")

	res, err := client.Do(req)
	if err != nil {
		fmt.Println(err)
		return "", err
	}
	defer res.Body.Close()

	//body, err := ioutil.ReadAll(res.Body)
	//if err != nil {
	//	fmt.Println(err)
	//	return "", err
	//}
	utils.CookiesAddNoRepetition(&cache.Cookies, res.Cookies())
	//fmt.Println(string(body))
	//下载验证码
	codeFileName := "code" + randChar[rand.Intn(len(randChar))] //生成验证码文件名称
	for i := 0; i < 10; i++ {
		codeFileName += randChar[rand.Intn(len(randChar))]
	}
	codeFileName += ".png"
	utils.PathExistForCreate("./assets/code/") //检测是否存在路径，如果不存在则创建
	filepath := fmt.Sprintf("./assets/code/%s", codeFileName)
	file, err := os.Create(filepath)
	if err != nil {
		res.Body.Close() //立即释放
		log.Println(err)
		return "", err
	}

	_, err = io.Copy(file, res.Body)
	if err != nil {
		res.Body.Close() //立即释放
		log.Println(err)
		return "", err
	}

	file.Close()
	if utils.IsBadImg(filepath) {
		res.Body.Close()           //立即释放
		utils.DeleteFile(filepath) //删除坏的文件
		return cache.PullCapterApi(retry-1, nil)
	}
	return filepath, nil
}

// {"code":"0","data":{"token":"3f5872ab-a461-4f76-b04e-b777f065d6d0","userId":"f96f49f8-dde0-46e5-8c0d-7050a5af64d8","userName":"21712aa0b3324cdc9f96df95316ee23a","realName":"魏涛","userNameLabel":"考生号","uniqueValue":"25611030390001","isBind":"1","tenantCode":"710065","batchCode":"012","gender":1,"openid":"oeNCVuNPgOivWXnp83OSMkPMKXl8","unionid":"oQSZgv2oLyEsqmrvMBYYP5k3vlr0","switchGoods":1,"switchDanger":1,"switchNetCase":1,"preBanner":"https://h.mycourse.cn/pharosfile/resources/images/projectbanner/pre.png","normalBanner":"https://h.mycourse.cn/pharosfile/resources/images/projectbanner/normal.png","specialBanner":"https://h.mycourse.cn/pharosfile/resources/images/projectbanner/special.png","militaryBanner":"https://h.mycourse.cn/pharosfile/resources/images/projectbanner/military.png","contestIndexImage":"https://weibanstatic.mycourse.cn/pharos/resource/710065/image/contest/20220413/f03fbbd4-d378-429c-910e-1da389cca7d2.jpg","contestThemeImage":"https://weibanstatic.mycourse.cn/pharos/resource/710065/image/contest/20220413/fe59b829-2124-4969-9691-c23f432ea0f8.jpg","isLoginFromWechat":2,"tenantName":"西安文理学院","tenantType":1,"loginSide":1,"popForcedCompleted":2,"showGender":2,"showOrg":2,"orgLabel":"院系","nickName":"魏涛","imageUrl":"https://resource.mycourse.cn/mercury/resources/mercury/wb/images/portrait.jpg","defensePower":60,"knowledgePower":60,"safetyIndex":99},"detailCode":"0"}
func (cache *WeiBanCache) LoginApi() (string, error) {
	url := "https://weiban.mycourse.cn/pharos/login/login.do"

	// 调用你之前写的 AES 加密函数
	//encryptData, err := Encrypt(string(jsonBytes))
	encryptData, err := Encrypt(`{"keyNumber":"` + cache.Account + `","password":"` + cache.Password + `","tenantCode":"` + cache.TenantCode + `","time":` + cache.VerifyTime + `,"verifyCode":"` + cache.VerifyCode + `"}`)
	if err != nil {
		return "", err
	}

	// 构造表单参数
	formData := []byte("data=" + encryptData)

	// 构造请求
	req, err := http.NewRequest("POST", url+"?timestamp="+cache.VerifyTime, bytes.NewBuffer(formData))
	if err != nil {
		return "", err
	}
	req.Header.Add("User-Agent", utils.DefaultUserAgent)
	req.Header.Add("Accept", "*/*")
	req.Header.Add("Host", "weiban.mycourse.cn")
	req.Header.Add("Connection", "keep-alive")
	req.Header.Set("Content-Type", "application/x-www-form-urlencoded")
	for _, cookie := range cache.Cookies {
		req.AddCookie(cookie)
	}

	// 发送请求
	client := &http.Client{}
	resp, err := client.Do(req)
	if err != nil {
		return "", err
	}
	defer resp.Body.Close()

	// 读取响应
	body, err := ioutil.ReadAll(resp.Body)
	if err != nil {
		return "", err
	}

	return string(body), nil
}

// PKCS7 填充
func pkcs7Padding(data []byte, blockSize int) []byte {
	padding := blockSize - len(data)%blockSize
	padText := bytes.Repeat([]byte{byte(padding)}, padding)
	return append(data, padText...)
}

// AES ECB 加密
func encryptECB(data, key []byte) ([]byte, error) {
	if len(key) != 16 && len(key) != 24 && len(key) != 32 {
		return nil, fmt.Errorf("invalid key size: %d", len(key))
	}
	block, err := aes.NewCipher(key)
	if err != nil {
		return nil, err
	}

	bs := block.BlockSize()
	data = pkcs7Padding(data, bs)
	encrypted := make([]byte, len(data))

	// ECB 手动分块加密
	for start := 0; start < len(data); start += bs {
		block.Encrypt(encrypted[start:start+bs], data[start:start+bs])
	}
	return encrypted, nil
}

func Encrypt(data string) (string, error) {
	key, err := base64.URLEncoding.DecodeString("d2JzNTEyAAAAAAAAAAAAAA==")
	if err != nil {
		return "", err
	}

	encData, err := encryptECB([]byte(data), key)
	if err != nil {
		return "", err
	}

	// 返回base64 编码字符串
	return base64.URLEncoding.EncodeToString(encData), nil
}
